<?php

return [

    //
    //'1000' => '调用其他平台接口错误',

    'undefined' => '未知错误',
    '500' => '系统错误',
    '00000' => '没有错误',
    //商家 10000

    '10000' => '账号输入错误',
    '10001' => '密码输入错误',

//    '10000' => '账号不存在',
//    '10001' => '密码错误',
//    '10002' => '注册失败',
//    '10003' => '验证码错误或已失效',
//    '10004' => '邮件发送失败',
//    '10005' => '您还没有登录或登录已失效！',
//    '10006' => '只允许上传:ext格式后缀的图片!',
//    '10007' => '图片资源保存失败!',
//    '10008' => '上传的图片资源不存在',
//    '10009' => '您的邮箱未激活,请登录邮箱激活!',
//    '10010' => '您的帐号已被冻结!',
//    '10011' => '商城已过期，请联系客服',
//    '10012' => '原密码输入不正确',
//    //活动 20000
//    '20000' => '奖品已被领完',
//    '20001' => '数量不足',
//    '20002' => '找不到相应奖品数据',
//    '20003' => '你不能参与该活动',
//    '20004' => '活动不存在',
//    '20005' => '你已参加过这个活动',
//    '20006' => '活动进入了暂停状态，请稍后再试',
//    //资源 30000
//    '30000' => '优惠券码不正确',
//    '30001' => '优惠券不存在',
//    '30002' => '短信发送失败，请稍后再试',
//    //
//
//    '40001' => '字段验证失败',

];